Rlesjak/am263_tractionDemo/trinv.syscfg
mpu_armv77.$name        = "CONFIG_MPU_REGION6";
mpu_armv77.baseAddr     = 0x701D0000;
mpu_armv77.size         = 15;
mpu_armv77.allowExecute = false;
mpu_armv77.attributes   = "Device";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC4_INT1"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc2.ADC.AIN2.$suggestSolution              = "ball.T12";
adc3.ADC.AIN0.$suggestSolution              = "ball.R10";
adc3.ADC.AIN2.$suggestSolution              = "ball.U10";
adc4.ADC.$suggestSolution                   = "ADC3";
adc4.ADC.AIN0.$suggestSolution              = "ball.U7";
adc4.ADC.AIN3.$suggestSolution              = "ball.R7";
adc5.ADC.$suggestSolution                   = "ADC0";
adc5.ADC.AIN2.$suggestSolution              = "ball.T14";
adc5.ADC.AIN3.$suggestSolution              = "ball.U14";
epwm2.EPWM.A.$suggestSolution               = "ball.B2";
epwm2.EPWM.B.$suggestSolution               = "ball.B1";
epwm3.EPWM.A.$suggestSolution               = "ball.D3";
epwm3.EPWM.B.$suggestSolution               = "ball.D2";
epwm4.EPWM.$suggestSolution                 = "EPWM2";
epwm4.EPWM.A.$suggestSolution               = "ball.C2";
epwm4.EPWM.B.$suggestSolution               = "ball.C1";
eqep1.EQEP.INDEX.$suggestSolution           = "ball.A12";
gpio1.GPIO.$suggestSolution                 = "GPIO0";
gpio2.GPIO.$suggestSolution                 = "GPIO0";
gpio3.GPIO.$suggestSolution                 = "GPIO0";
gpio4.GPIO.$suggestSolution                 = "GPIO0";
gpio5.GPIO.$suggestSolution                 = "GPIO0";
gpio6.GPIO.$suggestSolution                 = "GPIO0";
gpio7.GPIO.$suggestSolution                 = "GPIO0";
gpio8.GPIO.$suggestSolution                 = "GPIO0";
gpio9.GPIO.$suggestSolution                 = "GPIO0";
gpio10.GPIO.$suggestSolution                = "GPIO0";
gpio11.GPIO.$suggestSolution                = "GPIO0";
gpio12.GPIO.$suggestSolution                = "GPIO0";
gpio13.GPIO.$suggestSolution                = "GPIO0";
mcspi1.SPI.CLK.$suggestSolution             = "ball.A10";
mcspi1.SPI.D0.$suggestSolution              = "ball.B10";
mcspi1.SPI.D1.$suggestSolution              = "ball.D9";
mcspi1.mcspiChannel[0].CSn.$suggestSolution = "ball.C9";
uart1.UART.$suggestSolution                 = "UART1";
uart1.UART.RXD.$suggestSolution             = "ball.A9";
uart1.UART.TXD.$suggestSolution             = "ball.B9";
